package org.example;
import java.lang.Math;
public class Main {
    public static void main(String[] args) {
//        Дан массив целых чисел. Найти сумму элементов, у которых последняя и предпоследняя цифры равны.
//
//        int a = 1240;
//        int b = 1266;
//
//        if ((a%10 == (a/10)%10) && (b%10 == (b/10)%10)) {
//            System.out.println("b = " + (a + b));
//        }
//        System.out.println("НЕТ СОВПАДКЕНИЯ");
//        System.out.println();
//
//Напишите интерфейс Converter для конвертации из градусов по Цельсию в
//Кельвины, Фаренгейты. У классов наследников необходимо переопределить метод интерфейса, для валидного перевода величин. Метод для конвертации назовите "convertValue".
// Формулы перевода градусов по Цельсию ( degCelsius )в Фаренгейты (degFahrenheit) в Кельвины degKelvin)
//        System.out.println(" Введите величину градусов по Цельсию: ");
//        double degCelsius = -21;
//        double degFahrenheit = degCelsius*1.8+32;
//        double degKelvin = degCelsius+273.15;
//        System.out.println("В Фаренгейтах это составляет:");
//        System.out.printf("%.2f %n", degFahrenheit);
//        System.out.println("В Кельвинах это составляет:");
//        System.out.printf("%.2f %n", degKelvin);





    }
}